garyPenhook/PIC-Assembler/device_includes/pic16f17574.inc
// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0515h
// bitfield definitions
PWM2CON_ERSNOW_POSN                      equ 0000h
PWM2CON_ERSNOW_POSITION                  equ 0000h
PWM2CON_ERSNOW_SIZE                      equ 0001h
PWM2CON_ERSNOW_LENGTH                    equ 0001h
PWM2CON_ERSNOW_MASK                      equ 0001h
PWM2CON_ERSPOL_POSN                      equ 0001h
PWM2CON_ERSPOL_POSITION                  equ 0001h
PWM2CON_ERSPOL_SIZE                      equ 0001h
PWM2CON_ERSPOL_LENGTH                    equ 0001h
PWM2CON_ERSPOL_MASK                      equ 0002h
PWM2CON_LD_POSN                          equ 0002h
PWM2CON_LD_POSITION                      equ 0002h
PWM2CON_LD_SIZE                          equ 0001h
PWM2CON_LD_LENGTH                        equ 0001h
PWM2CON_LD_MASK                          equ 0004h
PWM2CON_EN_POSN                          equ 0007h
PWM2CON_EN_POSITION                      equ 0007h
PWM2CON_EN_SIZE                          equ 0001h
PWM2CON_EN_LENGTH                        equ 0001h
PWM2CON_EN_MASK                          equ 0080h

// Register: PWM2S1CFG
#define PWM2S1CFG PWM2S1CFG
PWM2S1CFG                                equ 0516h
// bitfield definitions
PWM2S1CFG_MODE_POSN                      equ 0000h
PWM2S1CFG_MODE_POSITION                  equ 0000h
PWM2S1CFG_MODE_SIZE                      equ 0003h
PWM2S1CFG_MODE_LENGTH                    equ 0003h
PWM2S1CFG_MODE_MASK                      equ 0007h
PWM2S1CFG_PPEN_POSN                      equ 0003h
PWM2S1CFG_PPEN_POSITION                  equ 0003h
PWM2S1CFG_PPEN_SIZE                      equ 0001h
PWM2S1CFG_PPEN_LENGTH                    equ 0001h
PWM2S1CFG_PPEN_MASK                      equ 0008h
PWM2S1CFG_POL1_POSN                      equ 0006h
PWM2S1CFG_POL1_POSITION                  equ 0006h
PWM2S1CFG_POL1_SIZE                      equ 0001h
PWM2S1CFG_POL1_LENGTH                    equ 0001h
PWM2S1CFG_POL1_MASK                      equ 0040h
PWM2S1CFG_POL2_POSN                      equ 0007h
PWM2S1CFG_POL2_POSITION                  equ 0007h
PWM2S1CFG_POL2_SIZE                      equ 0001h
PWM2S1CFG_POL2_LENGTH                    equ 0001h
PWM2S1CFG_POL2_MASK                      equ 0080h
PWM2S1CFG_MODE0_POSN                     equ 0000h
PWM2S1CFG_MODE0_POSITION                 equ 0000h
PWM2S1CFG_MODE0_SIZE                     equ 0001h
PWM2S1CFG_MODE0_LENGTH                   equ 0001h
PWM2S1CFG_MODE0_MASK                     equ 0001h
PWM2S1CFG_MODE1_POSN                     equ 0001h
PWM2S1CFG_MODE1_POSITION                 equ 0001h
PWM2S1CFG_MODE1_SIZE                     equ 0001h
PWM2S1CFG_MODE1_LENGTH                   equ 0001h
PWM2S1CFG_MODE1_MASK                     equ 0002h
PWM2S1CFG_MODE2_POSN                     equ 0002h
PWM2S1CFG_MODE2_POSITION                 equ 0002h
PWM2S1CFG_MODE2_SIZE                     equ 0001h
PWM2S1CFG_MODE2_LENGTH                   equ 0001h
PWM2S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM2S1P1L
#define PWM2S1P1L PWM2S1P1L
PWM2S1P1L                                equ 0517h
// bitfield definitions
PWM2S1P1L_P1L_POSN                       equ 0000h
PWM2S1P1L_P1L_POSITION                   equ 0000h
PWM2S1P1L_P1L_SIZE                       equ 0008h
PWM2S1P1L_P1L_LENGTH                     equ 0008h
PWM2S1P1L_P1L_MASK                       equ 00FFh
PWM2S1P1L_S1P1L_POSN                     equ 0000h
PWM2S1P1L_S1P1L_POSITION                 equ 0000h
PWM2S1P1L_S1P1L_SIZE                     equ 0008h
PWM2S1P1L_S1P1L_LENGTH                   equ 0008h
PWM2S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM2S1P1H
#define PWM2S1P1H PWM2S1P1H
PWM2S1P1H                                equ 0518h
// bitfield definitions
PWM2S1P1H_P1H_POSN                       equ 0000h
PWM2S1P1H_P1H_POSITION                   equ 0000h
PWM2S1P1H_P1H_SIZE                       equ 0008h
PWM2S1P1H_P1H_LENGTH                     equ 0008h
PWM2S1P1H_P1H_MASK                       equ 00FFh
PWM2S1P1H_S1P1H_POSN                     equ 0000h
PWM2S1P1H_S1P1H_POSITION                 equ 0000h
PWM2S1P1H_S1P1H_SIZE                     equ 0008h
PWM2S1P1H_S1P1H_LENGTH                   equ 0008h
PWM2S1P1H_S1P1H_MASK                     equ 00FFh

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
PWM2S1P2L                                equ 0519h
// bitfield definitions
PWM2S1P2L_P2L_POSN                       equ 0000h
PWM2S1P2L_P2L_POSITION                   equ 0000h
PWM2S1P2L_P2L_SIZE                       equ 0008h
PWM2S1P2L_P2L_LENGTH                     equ 0008h
PWM2S1P2L_P2L_MASK                       equ 00FFh
PWM2S1P2L_S1P2L_POSN                     equ 0000h
PWM2S1P2L_S1P2L_POSITION                 equ 0000h
PWM2S1P2L_S1P2L_SIZE                     equ 0008h
PWM2S1P2L_S1P2L_LENGTH                   equ 0008h
PWM2S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
PWM2S1P2H                                equ 051Ah
// bitfield definitions
PWM2S1P2H_P2H_POSN                       equ 0000h
PWM2S1P2H_P2H_POSITION                   equ 0000h
PWM2S1P2H_P2H_SIZE                       equ 0008h
PWM2S1P2H_P2H_LENGTH                     equ 0008h
PWM2S1P2H_P2H_MASK                       equ 00FFh
PWM2S1P2H_S1P2H_POSN                     equ 0000h
PWM2S1P2H_S1P2H_POSITION                 equ 0000h
PWM2S1P2H_S1P2H_SIZE                     equ 0008h
PWM2S1P2H_S1P2H_LENGTH                   equ 0008h
PWM2S1P2H_S1P2H_MASK                     equ 00FFh

// Register: NCO1ACCL
#define NCO1ACCL NCO1ACCL
NCO1ACCL                                 equ 058Ch
// bitfield definitions
NCO1ACCL_ACC_POSN                        equ 0000h
NCO1ACCL_ACC_POSITION                    equ 0000h
NCO1ACCL_ACC_SIZE                        equ 0008h
NCO1ACCL_ACC_LENGTH                      equ 0008h
NCO1ACCL_ACC_MASK                        equ 00FFh
NCO1ACCL_NCO1ACC0_POSN                   equ 0000h
NCO1ACCL_NCO1ACC0_POSITION               equ 0000h
NCO1ACCL_NCO1ACC0_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC0_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC0_MASK                   equ 0001h
NCO1ACCL_NCO1ACC1_POSN                   equ 0001h
NCO1ACCL_NCO1ACC1_POSITION               equ 0001h
NCO1ACCL_NCO1ACC1_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC1_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC1_MASK                   equ 0002h
NCO1ACCL_NCO1ACC2_POSN                   equ 0002h
NCO1ACCL_NCO1ACC2_POSITION               equ 0002h
NCO1ACCL_NCO1ACC2_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC2_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC2_MASK                   equ 0004h
NCO1ACCL_NCO1ACC3_POSN                   equ 0003h
NCO1ACCL_NCO1ACC3_POSITION               equ 0003h
NCO1ACCL_NCO1ACC3_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC3_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC3_MASK                   equ 0008h
NCO1ACCL_NCO1ACC4_POSN                   equ 0004h
NCO1ACCL_NCO1ACC4_POSITION               equ 0004h
NCO1ACCL_NCO1ACC4_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC4_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC4_MASK                   equ 0010h
NCO1ACCL_NCO1ACC5_POSN                   equ 0005h
NCO1ACCL_NCO1ACC5_POSITION               equ 0005h
NCO1ACCL_NCO1ACC5_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC5_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC5_MASK                   equ 0020h
NCO1ACCL_NCO1ACC6_POSN                   equ 0006h
NCO1ACCL_NCO1ACC6_POSITION               equ 0006h
NCO1ACCL_NCO1ACC6_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC6_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC6_MASK                   equ 0040h
NCO1ACCL_NCO1ACC7_POSN                   equ 0007h
NCO1ACCL_NCO1ACC7_POSITION               equ 0007h
NCO1ACCL_NCO1ACC7_SIZE                   equ 0001h
NCO1ACCL_NCO1ACC7_LENGTH                 equ 0001h
NCO1ACCL_NCO1ACC7_MASK                   equ 0080h
NCO1ACCL_ACC0_POSN                       equ 0000h
NCO1ACCL_ACC0_POSITION                   equ 0000h
NCO1ACCL_ACC0_SIZE                       equ 0001h
NCO1ACCL_ACC0_LENGTH                     equ 0001h
NCO1ACCL_ACC0_MASK                       equ 0001h
NCO1ACCL_ACC1_POSN                       equ 0001h
NCO1ACCL_ACC1_POSITION                   equ 0001h
NCO1ACCL_ACC1_SIZE                       equ 0001h
NCO1ACCL_ACC1_LENGTH                     equ 0001h
NCO1ACCL_ACC1_MASK                       equ 0002h
NCO1ACCL_ACC2_POSN                       equ 0002h
NCO1ACCL_ACC2_POSITION                   equ 0002h
NCO1ACCL_ACC2_SIZE                       equ 0001h
NCO1ACCL_ACC2_LENGTH                     equ 0001h
NCO1ACCL_ACC2_MASK                       equ 0004h
NCO1ACCL_ACC3_POSN                       equ 0003h
NCO1ACCL_ACC3_POSITION                   equ 0003h
NCO1ACCL_ACC3_SIZE                       equ 0001h
NCO1ACCL_ACC3_LENGTH                     equ 0001h
NCO1ACCL_ACC3_MASK                       equ 0008h
NCO1ACCL_ACC4_POSN                       equ 0004h
NCO1ACCL_ACC4_POSITION                   equ 0004h
NCO1ACCL_ACC4_SIZE                       equ 0001h
NCO1ACCL_ACC4_LENGTH                     equ 0001h
NCO1ACCL_ACC4_MASK                       equ 0010h
NCO1ACCL_ACC5_POSN                       equ 0005h
NCO1ACCL_ACC5_POSITION                   equ 0005h
NCO1ACCL_ACC5_SIZE                       equ 0001h
NCO1ACCL_ACC5_LENGTH                     equ 0001h
NCO1ACCL_ACC5_MASK                       equ 0020h
NCO1ACCL_ACC6_POSN                       equ 0006h
NCO1ACCL_ACC6_POSITION                   equ 0006h
NCO1ACCL_ACC6_SIZE                       equ 0001h
NCO1ACCL_ACC6_LENGTH                     equ 0001h
NCO1ACCL_ACC6_MASK                       equ 0040h
NCO1ACCL_ACC7_POSN                       equ 0007h
NCO1ACCL_ACC7_POSITION                   equ 0007h
NCO1ACCL_ACC7_SIZE                       equ 0001h
NCO1ACCL_ACC7_LENGTH                     equ 0001h
NCO1ACCL_ACC7_MASK                       equ 0080h
NCO1ACCL_NCO1ACC_POSN                    equ 0000h
NCO1ACCL_NCO1ACC_POSITION                equ 0000h
NCO1ACCL_NCO1ACC_SIZE                    equ 0008h
NCO1ACCL_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCL_NCO1ACC_MASK                    equ 00FFh

// Register: NCO1ACCH
#define NCO1ACCH NCO1ACCH
NCO1ACCH                                 equ 058Dh
// bitfield definitions
NCO1ACCH_ACC_POSN                        equ 0000h
NCO1ACCH_ACC_POSITION                    equ 0000h
NCO1ACCH_ACC_SIZE                        equ 0008h
NCO1ACCH_ACC_LENGTH                      equ 0008h
NCO1ACCH_ACC_MASK                        equ 00FFh
NCO1ACCH_NCO1ACC8_POSN                   equ 0000h
NCO1ACCH_NCO1ACC8_POSITION               equ 0000h
NCO1ACCH_NCO1ACC8_SIZE                   equ 0001h
NCO1ACCH_NCO1ACC8_LENGTH                 equ 0001h
NCO1ACCH_NCO1ACC8_MASK                   equ 0001h
NCO1ACCH_NCO1ACC9_POSN                   equ 0001h
NCO1ACCH_NCO1ACC9_POSITION               equ 0001h
NCO1ACCH_NCO1ACC9_SIZE                   equ 0001h
NCO1ACCH_NCO1ACC9_LENGTH                 equ 0001h
NCO1ACCH_NCO1ACC9_MASK                   equ 0002h
NCO1ACCH_NCO1ACC10_POSN                  equ 0002h
NCO1ACCH_NCO1ACC10_POSITION              equ 0002h
NCO1ACCH_NCO1ACC10_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC10_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC10_MASK                  equ 0004h
NCO1ACCH_NCO1ACC11_POSN                  equ 0003h
NCO1ACCH_NCO1ACC11_POSITION              equ 0003h
NCO1ACCH_NCO1ACC11_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC11_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC11_MASK                  equ 0008h
NCO1ACCH_NCO1ACC12_POSN                  equ 0004h
NCO1ACCH_NCO1ACC12_POSITION              equ 0004h
NCO1ACCH_NCO1ACC12_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC12_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC12_MASK                  equ 0010h
NCO1ACCH_NCO1ACC13_POSN                  equ 0005h
NCO1ACCH_NCO1ACC13_POSITION              equ 0005h
NCO1ACCH_NCO1ACC13_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC13_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC13_MASK                  equ 0020h
NCO1ACCH_NCO1ACC14_POSN                  equ 0006h
NCO1ACCH_NCO1ACC14_POSITION              equ 0006h
NCO1ACCH_NCO1ACC14_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC14_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC14_MASK                  equ 0040h
NCO1ACCH_NCO1ACC15_POSN                  equ 0007h
NCO1ACCH_NCO1ACC15_POSITION              equ 0007h
NCO1ACCH_NCO1ACC15_SIZE                  equ 0001h
NCO1ACCH_NCO1ACC15_LENGTH                equ 0001h
NCO1ACCH_NCO1ACC15_MASK                  equ 0080h
NCO1ACCH_ACC8_POSN                       equ 0000h
NCO1ACCH_ACC8_POSITION                   equ 0000h
NCO1ACCH_ACC8_SIZE                       equ 0001h
NCO1ACCH_ACC8_LENGTH                     equ 0001h
NCO1ACCH_ACC8_MASK                       equ 0001h
NCO1ACCH_ACC9_POSN                       equ 0001h
NCO1ACCH_ACC9_POSITION                   equ 0001h
NCO1ACCH_ACC9_SIZE                       equ 0001h
NCO1ACCH_ACC9_LENGTH                     equ 0001h
NCO1ACCH_ACC9_MASK                       equ 0002h
NCO1ACCH_ACC10_POSN                      equ 0002h
NCO1ACCH_ACC10_POSITION                  equ 0002h
NCO1ACCH_ACC10_SIZE                      equ 0001h
NCO1ACCH_ACC10_LENGTH                    equ 0001h
NCO1ACCH_ACC10_MASK                      equ 0004h
NCO1ACCH_ACC11_POSN                      equ 0003h
NCO1ACCH_ACC11_POSITION                  equ 0003h
NCO1ACCH_ACC11_SIZE                      equ 0001h
NCO1ACCH_ACC11_LENGTH                    equ 0001h
NCO1ACCH_ACC11_MASK                      equ 0008h
NCO1ACCH_ACC12_POSN                      equ 0004h
NCO1ACCH_ACC12_POSITION                  equ 0004h
NCO1ACCH_ACC12_SIZE                      equ 0001h
NCO1ACCH_ACC12_LENGTH                    equ 0001h
NCO1ACCH_ACC12_MASK                      equ 0010h
NCO1ACCH_ACC13_POSN                      equ 0005h
NCO1ACCH_ACC13_POSITION                  equ 0005h
NCO1ACCH_ACC13_SIZE                      equ 0001h
NCO1ACCH_ACC13_LENGTH                    equ 0001h
NCO1ACCH_ACC13_MASK                      equ 0020h
NCO1ACCH_ACC14_POSN                      equ 0006h
NCO1ACCH_ACC14_POSITION                  equ 0006h
NCO1ACCH_ACC14_SIZE                      equ 0001h
NCO1ACCH_ACC14_LENGTH                    equ 0001h
NCO1ACCH_ACC14_MASK                      equ 0040h
NCO1ACCH_ACC15_POSN                      equ 0007h
NCO1ACCH_ACC15_POSITION                  equ 0007h
NCO1ACCH_ACC15_SIZE                      equ 0001h
NCO1ACCH_ACC15_LENGTH                    equ 0001h
NCO1ACCH_ACC15_MASK                      equ 0080h
NCO1ACCH_NCO1ACC_POSN                    equ 0000h
NCO1ACCH_NCO1ACC_POSITION                equ 0000h
NCO1ACCH_NCO1ACC_SIZE                    equ 0008h
NCO1ACCH_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCH_NCO1ACC_MASK                    equ 00FFh

