garyPenhook/PIC-Assembler/device_includes/pic16f17574.inc
// Register: OPA2CON2
#define OPA2CON2 OPA2CON2
OPA2CON2                                 equ 0914h
// bitfield definitions
OPA2CON2_PCH_POSN                        equ 0000h
OPA2CON2_PCH_POSITION                    equ 0000h
OPA2CON2_PCH_SIZE                        equ 0004h
OPA2CON2_PCH_LENGTH                      equ 0004h
OPA2CON2_PCH_MASK                        equ 000Fh
OPA2CON2_FMS_POSN                        equ 0006h
OPA2CON2_FMS_POSITION                    equ 0006h
OPA2CON2_FMS_SIZE                        equ 0002h
OPA2CON2_FMS_LENGTH                      equ 0002h
OPA2CON2_FMS_MASK                        equ 00C0h
OPA2CON2_PCH0_POSN                       equ 0000h
OPA2CON2_PCH0_POSITION                   equ 0000h
OPA2CON2_PCH0_SIZE                       equ 0001h
OPA2CON2_PCH0_LENGTH                     equ 0001h
OPA2CON2_PCH0_MASK                       equ 0001h
OPA2CON2_PCH1_POSN                       equ 0001h
OPA2CON2_PCH1_POSITION                   equ 0001h
OPA2CON2_PCH1_SIZE                       equ 0001h
OPA2CON2_PCH1_LENGTH                     equ 0001h
OPA2CON2_PCH1_MASK                       equ 0002h
OPA2CON2_PCH2_POSN                       equ 0002h
OPA2CON2_PCH2_POSITION                   equ 0002h
OPA2CON2_PCH2_SIZE                       equ 0001h
OPA2CON2_PCH2_LENGTH                     equ 0001h
OPA2CON2_PCH2_MASK                       equ 0004h
OPA2CON2_PCH3_POSN                       equ 0003h
OPA2CON2_PCH3_POSITION                   equ 0003h
OPA2CON2_PCH3_SIZE                       equ 0001h
OPA2CON2_PCH3_LENGTH                     equ 0001h
OPA2CON2_PCH3_MASK                       equ 0008h
OPA2CON2_FMS0_POSN                       equ 0006h
OPA2CON2_FMS0_POSITION                   equ 0006h
OPA2CON2_FMS0_SIZE                       equ 0001h
OPA2CON2_FMS0_LENGTH                     equ 0001h
OPA2CON2_FMS0_MASK                       equ 0040h
OPA2CON2_FMS1_POSN                       equ 0007h
OPA2CON2_FMS1_POSITION                   equ 0007h
OPA2CON2_FMS1_SIZE                       equ 0001h
OPA2CON2_FMS1_LENGTH                     equ 0001h
OPA2CON2_FMS1_MASK                       equ 0080h
OPA2CON2_OPA2PCH_POSN                    equ 0000h
OPA2CON2_OPA2PCH_POSITION                equ 0000h
OPA2CON2_OPA2PCH_SIZE                    equ 0004h
OPA2CON2_OPA2PCH_LENGTH                  equ 0004h
OPA2CON2_OPA2PCH_MASK                    equ 000Fh
OPA2CON2_OPA2FMS_POSN                    equ 0006h
OPA2CON2_OPA2FMS_POSITION                equ 0006h
OPA2CON2_OPA2FMS_SIZE                    equ 0002h
OPA2CON2_OPA2FMS_LENGTH                  equ 0002h
OPA2CON2_OPA2FMS_MASK                    equ 00C0h
OPA2CON2_OPA2PCH0_POSN                   equ 0000h
OPA2CON2_OPA2PCH0_POSITION               equ 0000h
OPA2CON2_OPA2PCH0_SIZE                   equ 0001h
OPA2CON2_OPA2PCH0_LENGTH                 equ 0001h
OPA2CON2_OPA2PCH0_MASK                   equ 0001h
OPA2CON2_OPA2PCH1_POSN                   equ 0001h
OPA2CON2_OPA2PCH1_POSITION               equ 0001h
OPA2CON2_OPA2PCH1_SIZE                   equ 0001h
OPA2CON2_OPA2PCH1_LENGTH                 equ 0001h
OPA2CON2_OPA2PCH1_MASK                   equ 0002h
OPA2CON2_OPA2PCH2_POSN                   equ 0002h
OPA2CON2_OPA2PCH2_POSITION               equ 0002h
OPA2CON2_OPA2PCH2_SIZE                   equ 0001h
OPA2CON2_OPA2PCH2_LENGTH                 equ 0001h
OPA2CON2_OPA2PCH2_MASK                   equ 0004h
OPA2CON2_OPA2PCH3_POSN                   equ 0003h
OPA2CON2_OPA2PCH3_POSITION               equ 0003h
OPA2CON2_OPA2PCH3_SIZE                   equ 0001h
OPA2CON2_OPA2PCH3_LENGTH                 equ 0001h
OPA2CON2_OPA2PCH3_MASK                   equ 0008h
OPA2CON2_OPA2FMS0_POSN                   equ 0006h
OPA2CON2_OPA2FMS0_POSITION               equ 0006h
OPA2CON2_OPA2FMS0_SIZE                   equ 0001h
OPA2CON2_OPA2FMS0_LENGTH                 equ 0001h
OPA2CON2_OPA2FMS0_MASK                   equ 0040h
OPA2CON2_OPA2FMS1_POSN                   equ 0007h
OPA2CON2_OPA2FMS1_POSITION               equ 0007h
OPA2CON2_OPA2FMS1_SIZE                   equ 0001h
OPA2CON2_OPA2FMS1_LENGTH                 equ 0001h
OPA2CON2_OPA2FMS1_MASK                   equ 0080h

// Register: OPA2CON3
#define OPA2CON3 OPA2CON3
OPA2CON3                                 equ 0915h
// bitfield definitions
OPA2CON3_NCH_POSN                        equ 0000h
OPA2CON3_NCH_POSITION                    equ 0000h
OPA2CON3_NCH_SIZE                        equ 0005h
OPA2CON3_NCH_LENGTH                      equ 0005h
OPA2CON3_NCH_MASK                        equ 001Fh
OPA2CON3_NCH0_POSN                       equ 0000h
OPA2CON3_NCH0_POSITION                   equ 0000h
OPA2CON3_NCH0_SIZE                       equ 0001h
OPA2CON3_NCH0_LENGTH                     equ 0001h
OPA2CON3_NCH0_MASK                       equ 0001h
OPA2CON3_NCH1_POSN                       equ 0001h
OPA2CON3_NCH1_POSITION                   equ 0001h
OPA2CON3_NCH1_SIZE                       equ 0001h
OPA2CON3_NCH1_LENGTH                     equ 0001h
OPA2CON3_NCH1_MASK                       equ 0002h
OPA2CON3_NCH2_POSN                       equ 0002h
OPA2CON3_NCH2_POSITION                   equ 0002h
OPA2CON3_NCH2_SIZE                       equ 0001h
OPA2CON3_NCH2_LENGTH                     equ 0001h
OPA2CON3_NCH2_MASK                       equ 0004h
OPA2CON3_NCH3_POSN                       equ 0003h
OPA2CON3_NCH3_POSITION                   equ 0003h
OPA2CON3_NCH3_SIZE                       equ 0001h
OPA2CON3_NCH3_LENGTH                     equ 0001h
OPA2CON3_NCH3_MASK                       equ 0008h
OPA2CON3_OPA2NCH_POSN                    equ 0000h
OPA2CON3_OPA2NCH_POSITION                equ 0000h
OPA2CON3_OPA2NCH_SIZE                    equ 0005h
OPA2CON3_OPA2NCH_LENGTH                  equ 0005h
OPA2CON3_OPA2NCH_MASK                    equ 001Fh
OPA2CON3_OPA2NCH0_POSN                   equ 0000h
OPA2CON3_OPA2NCH0_POSITION               equ 0000h
OPA2CON3_OPA2NCH0_SIZE                   equ 0001h
OPA2CON3_OPA2NCH0_LENGTH                 equ 0001h
OPA2CON3_OPA2NCH0_MASK                   equ 0001h
OPA2CON3_OPA2NCH1_POSN                   equ 0001h
OPA2CON3_OPA2NCH1_POSITION               equ 0001h
OPA2CON3_OPA2NCH1_SIZE                   equ 0001h
OPA2CON3_OPA2NCH1_LENGTH                 equ 0001h
OPA2CON3_OPA2NCH1_MASK                   equ 0002h
OPA2CON3_OPA2NCH2_POSN                   equ 0002h
OPA2CON3_OPA2NCH2_POSITION               equ 0002h
OPA2CON3_OPA2NCH2_SIZE                   equ 0001h
OPA2CON3_OPA2NCH2_LENGTH                 equ 0001h
OPA2CON3_OPA2NCH2_MASK                   equ 0004h
OPA2CON3_OPA2NCH3_POSN                   equ 0003h
OPA2CON3_OPA2NCH3_POSITION               equ 0003h
OPA2CON3_OPA2NCH3_SIZE                   equ 0001h
OPA2CON3_OPA2NCH3_LENGTH                 equ 0001h
OPA2CON3_OPA2NCH3_MASK                   equ 0008h

// Register: OPA2OFFSET
#define OPA2OFFSET OPA2OFFSET
OPA2OFFSET                               equ 0916h
// bitfield definitions
OPA2OFFSET_OFFSET_POSN                   equ 0000h
OPA2OFFSET_OFFSET_POSITION               equ 0000h
OPA2OFFSET_OFFSET_SIZE                   equ 0008h
OPA2OFFSET_OFFSET_LENGTH                 equ 0008h
OPA2OFFSET_OFFSET_MASK                   equ 00FFh
OPA2OFFSET_OFFSET0_POSN                  equ 0000h
OPA2OFFSET_OFFSET0_POSITION              equ 0000h
OPA2OFFSET_OFFSET0_SIZE                  equ 0001h
OPA2OFFSET_OFFSET0_LENGTH                equ 0001h
OPA2OFFSET_OFFSET0_MASK                  equ 0001h
OPA2OFFSET_OFFSET1_POSN                  equ 0001h
OPA2OFFSET_OFFSET1_POSITION              equ 0001h
OPA2OFFSET_OFFSET1_SIZE                  equ 0001h
OPA2OFFSET_OFFSET1_LENGTH                equ 0001h
OPA2OFFSET_OFFSET1_MASK                  equ 0002h
OPA2OFFSET_OFFSET2_POSN                  equ 0002h
OPA2OFFSET_OFFSET2_POSITION              equ 0002h
OPA2OFFSET_OFFSET2_SIZE                  equ 0001h
OPA2OFFSET_OFFSET2_LENGTH                equ 0001h
OPA2OFFSET_OFFSET2_MASK                  equ 0004h
OPA2OFFSET_OFFSET3_POSN                  equ 0003h
OPA2OFFSET_OFFSET3_POSITION              equ 0003h
OPA2OFFSET_OFFSET3_SIZE                  equ 0001h
OPA2OFFSET_OFFSET3_LENGTH                equ 0001h
OPA2OFFSET_OFFSET3_MASK                  equ 0008h
OPA2OFFSET_OFFSET4_POSN                  equ 0004h
OPA2OFFSET_OFFSET4_POSITION              equ 0004h
OPA2OFFSET_OFFSET4_SIZE                  equ 0001h
OPA2OFFSET_OFFSET4_LENGTH                equ 0001h
OPA2OFFSET_OFFSET4_MASK                  equ 0010h
OPA2OFFSET_OFFSET5_POSN                  equ 0005h
OPA2OFFSET_OFFSET5_POSITION              equ 0005h
OPA2OFFSET_OFFSET5_SIZE                  equ 0001h
OPA2OFFSET_OFFSET5_LENGTH                equ 0001h
OPA2OFFSET_OFFSET5_MASK                  equ 0020h
OPA2OFFSET_OFFSET6_POSN                  equ 0006h
OPA2OFFSET_OFFSET6_POSITION              equ 0006h
OPA2OFFSET_OFFSET6_SIZE                  equ 0001h
OPA2OFFSET_OFFSET6_LENGTH                equ 0001h
OPA2OFFSET_OFFSET6_MASK                  equ 0040h
OPA2OFFSET_OFFSET7_POSN                  equ 0007h
OPA2OFFSET_OFFSET7_POSITION              equ 0007h
OPA2OFFSET_OFFSET7_SIZE                  equ 0001h
OPA2OFFSET_OFFSET7_LENGTH                equ 0001h
OPA2OFFSET_OFFSET7_MASK                  equ 0080h
OPA2OFFSET_OPA2OFFSET_POSN               equ 0000h
OPA2OFFSET_OPA2OFFSET_POSITION           equ 0000h
OPA2OFFSET_OPA2OFFSET_SIZE               equ 0008h
OPA2OFFSET_OPA2OFFSET_LENGTH             equ 0008h
OPA2OFFSET_OPA2OFFSET_MASK               equ 00FFh
OPA2OFFSET_OPA2OFFSET0_POSN              equ 0000h
OPA2OFFSET_OPA2OFFSET0_POSITION          equ 0000h
OPA2OFFSET_OPA2OFFSET0_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET0_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET0_MASK              equ 0001h
OPA2OFFSET_OPA2OFFSET1_POSN              equ 0001h
OPA2OFFSET_OPA2OFFSET1_POSITION          equ 0001h
OPA2OFFSET_OPA2OFFSET1_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET1_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET1_MASK              equ 0002h
OPA2OFFSET_OPA2OFFSET2_POSN              equ 0002h
OPA2OFFSET_OPA2OFFSET2_POSITION          equ 0002h
OPA2OFFSET_OPA2OFFSET2_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET2_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET2_MASK              equ 0004h
OPA2OFFSET_OPA2OFFSET3_POSN              equ 0003h
OPA2OFFSET_OPA2OFFSET3_POSITION          equ 0003h
OPA2OFFSET_OPA2OFFSET3_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET3_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET3_MASK              equ 0008h
OPA2OFFSET_OPA2OFFSET4_POSN              equ 0004h
OPA2OFFSET_OPA2OFFSET4_POSITION          equ 0004h
OPA2OFFSET_OPA2OFFSET4_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET4_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET4_MASK              equ 0010h
OPA2OFFSET_OPA2OFFSET5_POSN              equ 0005h
OPA2OFFSET_OPA2OFFSET5_POSITION          equ 0005h
OPA2OFFSET_OPA2OFFSET5_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET5_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET5_MASK              equ 0020h
OPA2OFFSET_OPA2OFFSET6_POSN              equ 0006h
OPA2OFFSET_OPA2OFFSET6_POSITION          equ 0006h
OPA2OFFSET_OPA2OFFSET6_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET6_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET6_MASK              equ 0040h
OPA2OFFSET_OPA2OFFSET7_POSN              equ 0007h
OPA2OFFSET_OPA2OFFSET7_POSITION          equ 0007h
OPA2OFFSET_OPA2OFFSET7_SIZE              equ 0001h
OPA2OFFSET_OPA2OFFSET7_LENGTH            equ 0001h
OPA2OFFSET_OPA2OFFSET7_MASK              equ 0080h

// Register: OPA2CON4
#define OPA2CON4 OPA2CON4
OPA2CON4                                 equ 0917h
// bitfield definitions
OPA2CON4_OFCSEL_POSN                     equ 0000h
OPA2CON4_OFCSEL_POSITION                 equ 0000h
OPA2CON4_OFCSEL_SIZE                     equ 0002h
OPA2CON4_OFCSEL_LENGTH                   equ 0002h
OPA2CON4_OFCSEL_MASK                     equ 0003h
OPA2CON4_OFCST_POSN                      equ 0002h
OPA2CON4_OFCST_POSITION                  equ 0002h
OPA2CON4_OFCST_SIZE                      equ 0001h
OPA2CON4_OFCST_LENGTH                    equ 0001h
OPA2CON4_OFCST_MASK                      equ 0004h
OPA2CON4_OFCSEL0_POSN                    equ 0000h
OPA2CON4_OFCSEL0_POSITION                equ 0000h
OPA2CON4_OFCSEL0_SIZE                    equ 0001h
OPA2CON4_OFCSEL0_LENGTH                  equ 0001h
OPA2CON4_OFCSEL0_MASK                    equ 0001h
OPA2CON4_OFCSEL1_POSN                    equ 0001h
OPA2CON4_OFCSEL1_POSITION                equ 0001h
OPA2CON4_OFCSEL1_SIZE                    equ 0001h
OPA2CON4_OFCSEL1_LENGTH                  equ 0001h
OPA2CON4_OFCSEL1_MASK                    equ 0002h
OPA2CON4_OPA2OFCSEL_POSN                 equ 0000h
OPA2CON4_OPA2OFCSEL_POSITION             equ 0000h
OPA2CON4_OPA2OFCSEL_SIZE                 equ 0002h
OPA2CON4_OPA2OFCSEL_LENGTH               equ 0002h
OPA2CON4_OPA2OFCSEL_MASK                 equ 0003h
OPA2CON4_OPA2OFCST_POSN                  equ 0002h
OPA2CON4_OPA2OFCST_POSITION              equ 0002h
OPA2CON4_OPA2OFCST_SIZE                  equ 0001h
OPA2CON4_OPA2OFCST_LENGTH                equ 0001h
OPA2CON4_OPA2OFCST_MASK                  equ 0004h
OPA2CON4_OPA2OFCSEL0_POSN                equ 0000h
OPA2CON4_OPA2OFCSEL0_POSITION            equ 0000h
OPA2CON4_OPA2OFCSEL0_SIZE                equ 0001h
OPA2CON4_OPA2OFCSEL0_LENGTH              equ 0001h
OPA2CON4_OPA2OFCSEL0_MASK                equ 0001h
OPA2CON4_OPA2OFCSEL1_POSN                equ 0001h
OPA2CON4_OPA2OFCSEL1_POSITION            equ 0001h
OPA2CON4_OPA2OFCSEL1_SIZE                equ 0001h
OPA2CON4_OPA2OFCSEL1_LENGTH              equ 0001h
OPA2CON4_OPA2OFCSEL1_MASK                equ 0002h

