garyPenhook/PIC-Assembler/device_includes/pic16f17574.inc
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
PWMIN0PPS                                equ 01E24h
// bitfield definitions
PWMIN0PPS_PWMIN0PPS_POSN                 equ 0000h
PWMIN0PPS_PWMIN0PPS_POSITION             equ 0000h
PWMIN0PPS_PWMIN0PPS_SIZE                 equ 0007h
PWMIN0PPS_PWMIN0PPS_LENGTH               equ 0007h
PWMIN0PPS_PWMIN0PPS_MASK                 equ 007Fh

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
PWMIN1PPS                                equ 01E25h
// bitfield definitions
PWMIN1PPS_PWMIN1PPS_POSN                 equ 0000h
PWMIN1PPS_PWMIN1PPS_POSITION             equ 0000h
PWMIN1PPS_PWMIN1PPS_SIZE                 equ 0007h
PWMIN1PPS_PWMIN1PPS_LENGTH               equ 0007h
PWMIN1PPS_PWMIN1PPS_MASK                 equ 007Fh

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
PWM1ERSPPS                               equ 01E26h
// bitfield definitions
PWM1ERSPPS_PWM1ERSPPS_POSN               equ 0000h
PWM1ERSPPS_PWM1ERSPPS_POSITION           equ 0000h
PWM1ERSPPS_PWM1ERSPPS_SIZE               equ 0007h
PWM1ERSPPS_PWM1ERSPPS_LENGTH             equ 0007h
PWM1ERSPPS_PWM1ERSPPS_MASK               equ 007Fh

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
PWM2ERSPPS                               equ 01E27h
// bitfield definitions
PWM2ERSPPS_PWM2ERSPPS_POSN               equ 0000h
PWM2ERSPPS_PWM2ERSPPS_POSITION           equ 0000h
PWM2ERSPPS_PWM2ERSPPS_SIZE               equ 0007h
PWM2ERSPPS_PWM2ERSPPS_LENGTH             equ 0007h
PWM2ERSPPS_PWM2ERSPPS_MASK               equ 007Fh

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
CWG1PPS                                  equ 01E39h
// bitfield definitions
CWG1PPS_CWG1PPS_POSN                     equ 0000h
CWG1PPS_CWG1PPS_POSITION                 equ 0000h
CWG1PPS_CWG1PPS_SIZE                     equ 0007h
CWG1PPS_CWG1PPS_LENGTH                   equ 0007h
CWG1PPS_CWG1PPS_MASK                     equ 007Fh
CWG1PPS_CWG1PPS0_POSN                    equ 0000h
CWG1PPS_CWG1PPS0_POSITION                equ 0000h
CWG1PPS_CWG1PPS0_SIZE                    equ 0001h
CWG1PPS_CWG1PPS0_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS0_MASK                    equ 0001h
CWG1PPS_CWG1PPS1_POSN                    equ 0001h
CWG1PPS_CWG1PPS1_POSITION                equ 0001h
CWG1PPS_CWG1PPS1_SIZE                    equ 0001h
CWG1PPS_CWG1PPS1_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS1_MASK                    equ 0002h
CWG1PPS_CWG1PPS2_POSN                    equ 0002h
CWG1PPS_CWG1PPS2_POSITION                equ 0002h
CWG1PPS_CWG1PPS2_SIZE                    equ 0001h
CWG1PPS_CWG1PPS2_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS2_MASK                    equ 0004h
CWG1PPS_CWG1PPS3_POSN                    equ 0003h
CWG1PPS_CWG1PPS3_POSITION                equ 0003h
CWG1PPS_CWG1PPS3_SIZE                    equ 0001h
CWG1PPS_CWG1PPS3_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS3_MASK                    equ 0008h
CWG1PPS_CWG1PPS4_POSN                    equ 0004h
CWG1PPS_CWG1PPS4_POSITION                equ 0004h
CWG1PPS_CWG1PPS4_SIZE                    equ 0001h
CWG1PPS_CWG1PPS4_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS4_MASK                    equ 0010h
CWG1PPS_CWG1PPS5_POSN                    equ 0005h
CWG1PPS_CWG1PPS5_POSITION                equ 0005h
CWG1PPS_CWG1PPS5_SIZE                    equ 0001h
CWG1PPS_CWG1PPS5_LENGTH                  equ 0001h
CWG1PPS_CWG1PPS5_MASK                    equ 0020h

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 01E3Dh
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0007h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0007h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 007Fh
CLCIN0PPS_CLCIN0PPS0_POSN                equ 0000h
CLCIN0PPS_CLCIN0PPS0_POSITION            equ 0000h
CLCIN0PPS_CLCIN0PPS0_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS0_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS0_MASK                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSN                equ 0001h
CLCIN0PPS_CLCIN0PPS1_POSITION            equ 0001h
CLCIN0PPS_CLCIN0PPS1_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS1_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS1_MASK                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSN                equ 0002h
CLCIN0PPS_CLCIN0PPS2_POSITION            equ 0002h
CLCIN0PPS_CLCIN0PPS2_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS2_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS2_MASK                equ 0004h
CLCIN0PPS_CLCIN0PPS3_POSN                equ 0003h
CLCIN0PPS_CLCIN0PPS3_POSITION            equ 0003h
CLCIN0PPS_CLCIN0PPS3_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS3_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS3_MASK                equ 0008h
CLCIN0PPS_CLCIN0PPS4_POSN                equ 0004h
CLCIN0PPS_CLCIN0PPS4_POSITION            equ 0004h
CLCIN0PPS_CLCIN0PPS4_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS4_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS4_MASK                equ 0010h
CLCIN0PPS_CLCIN0PPS5_POSN                equ 0005h
CLCIN0PPS_CLCIN0PPS5_POSITION            equ 0005h
CLCIN0PPS_CLCIN0PPS5_SIZE                equ 0001h
CLCIN0PPS_CLCIN0PPS5_LENGTH              equ 0001h
CLCIN0PPS_CLCIN0PPS5_MASK                equ 0020h

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 01E3Eh
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0007h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0007h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 007Fh
CLCIN1PPS_CLCIN1PPS0_POSN                equ 0000h
CLCIN1PPS_CLCIN1PPS0_POSITION            equ 0000h
CLCIN1PPS_CLCIN1PPS0_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS0_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS0_MASK                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSN                equ 0001h
CLCIN1PPS_CLCIN1PPS1_POSITION            equ 0001h
CLCIN1PPS_CLCIN1PPS1_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS1_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS1_MASK                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSN                equ 0002h
CLCIN1PPS_CLCIN1PPS2_POSITION            equ 0002h
CLCIN1PPS_CLCIN1PPS2_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS2_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS2_MASK                equ 0004h
CLCIN1PPS_CLCIN1PPS3_POSN                equ 0003h
CLCIN1PPS_CLCIN1PPS3_POSITION            equ 0003h
CLCIN1PPS_CLCIN1PPS3_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS3_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS3_MASK                equ 0008h
CLCIN1PPS_CLCIN1PPS4_POSN                equ 0004h
CLCIN1PPS_CLCIN1PPS4_POSITION            equ 0004h
CLCIN1PPS_CLCIN1PPS4_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS4_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS4_MASK                equ 0010h
CLCIN1PPS_CLCIN1PPS5_POSN                equ 0005h
CLCIN1PPS_CLCIN1PPS5_POSITION            equ 0005h
CLCIN1PPS_CLCIN1PPS5_SIZE                equ 0001h
CLCIN1PPS_CLCIN1PPS5_LENGTH              equ 0001h
CLCIN1PPS_CLCIN1PPS5_MASK                equ 0020h

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 01E3Fh
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0007h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0007h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 007Fh
CLCIN2PPS_CLCIN2PPS0_POSN                equ 0000h
CLCIN2PPS_CLCIN2PPS0_POSITION            equ 0000h
CLCIN2PPS_CLCIN2PPS0_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS0_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS0_MASK                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSN                equ 0001h
CLCIN2PPS_CLCIN2PPS1_POSITION            equ 0001h
CLCIN2PPS_CLCIN2PPS1_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS1_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS1_MASK                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSN                equ 0002h
CLCIN2PPS_CLCIN2PPS2_POSITION            equ 0002h
CLCIN2PPS_CLCIN2PPS2_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS2_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS2_MASK                equ 0004h
CLCIN2PPS_CLCIN2PPS3_POSN                equ 0003h
CLCIN2PPS_CLCIN2PPS3_POSITION            equ 0003h
CLCIN2PPS_CLCIN2PPS3_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS3_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS3_MASK                equ 0008h
CLCIN2PPS_CLCIN2PPS4_POSN                equ 0004h
CLCIN2PPS_CLCIN2PPS4_POSITION            equ 0004h
CLCIN2PPS_CLCIN2PPS4_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS4_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS4_MASK                equ 0010h
CLCIN2PPS_CLCIN2PPS5_POSN                equ 0005h
CLCIN2PPS_CLCIN2PPS5_POSITION            equ 0005h
CLCIN2PPS_CLCIN2PPS5_SIZE                equ 0001h
CLCIN2PPS_CLCIN2PPS5_LENGTH              equ 0001h
CLCIN2PPS_CLCIN2PPS5_MASK                equ 0020h

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 01E40h
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0007h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0007h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 007Fh
CLCIN3PPS_CLCIN3PPS0_POSN                equ 0000h
CLCIN3PPS_CLCIN3PPS0_POSITION            equ 0000h
CLCIN3PPS_CLCIN3PPS0_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS0_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS0_MASK                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSN                equ 0001h
CLCIN3PPS_CLCIN3PPS1_POSITION            equ 0001h
CLCIN3PPS_CLCIN3PPS1_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS1_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS1_MASK                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSN                equ 0002h
CLCIN3PPS_CLCIN3PPS2_POSITION            equ 0002h
CLCIN3PPS_CLCIN3PPS2_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS2_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS2_MASK                equ 0004h
CLCIN3PPS_CLCIN3PPS3_POSN                equ 0003h
CLCIN3PPS_CLCIN3PPS3_POSITION            equ 0003h
CLCIN3PPS_CLCIN3PPS3_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS3_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS3_MASK                equ 0008h
CLCIN3PPS_CLCIN3PPS4_POSN                equ 0004h
CLCIN3PPS_CLCIN3PPS4_POSITION            equ 0004h
CLCIN3PPS_CLCIN3PPS4_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS4_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS4_MASK                equ 0010h
CLCIN3PPS_CLCIN3PPS5_POSN                equ 0005h
CLCIN3PPS_CLCIN3PPS5_POSITION            equ 0005h
CLCIN3PPS_CLCIN3PPS5_SIZE                equ 0001h
CLCIN3PPS_CLCIN3PPS5_LENGTH              equ 0001h
CLCIN3PPS_CLCIN3PPS5_MASK                equ 0020h

