garyPenhook/PIC-Assembler/device_includes/pic16f17574.inc
// Register: APMEND1L
#define APMEND1L APMEND1L
APMEND1L                                 equ 01F5Ch
// bitfield definitions
APMEND1L_END1_POSN                       equ 0000h
APMEND1L_END1_POSITION                   equ 0000h
APMEND1L_END1_SIZE                       equ 0008h
APMEND1L_END1_LENGTH                     equ 0008h
APMEND1L_END1_MASK                       equ 00FFh

// Register: APMEND1H
#define APMEND1H APMEND1H
APMEND1H                                 equ 01F5Dh
// bitfield definitions
APMEND1H_END1_POSN                       equ 0000h
APMEND1H_END1_POSITION                   equ 0000h
APMEND1H_END1_SIZE                       equ 0008h
APMEND1H_END1_LENGTH                     equ 0008h
APMEND1H_END1_MASK                       equ 00FFh

// Register: APMEND1U
#define APMEND1U APMEND1U
APMEND1U                                 equ 01F5Eh
// bitfield definitions
APMEND1U_END1_POSN                       equ 0000h
APMEND1U_END1_POSITION                   equ 0000h
APMEND1U_END1_SIZE                       equ 0008h
APMEND1U_END1_LENGTH                     equ 0008h
APMEND1U_END1_MASK                       equ 00FFh

// Register: APMPERE1L
#define APMPERE1L APMPERE1L
APMPERE1L                                equ 01F5Fh
// bitfield definitions
APMPERE1L_APMPERE1_POSN                  equ 0000h
APMPERE1L_APMPERE1_POSITION              equ 0000h
APMPERE1L_APMPERE1_SIZE                  equ 0008h
APMPERE1L_APMPERE1_LENGTH                equ 0008h
APMPERE1L_APMPERE1_MASK                  equ 00FFh
APMPERE1L_SOSC_POSN                      equ 0000h
APMPERE1L_SOSC_POSITION                  equ 0000h
APMPERE1L_SOSC_SIZE                      equ 0001h
APMPERE1L_SOSC_LENGTH                    equ 0001h
APMPERE1L_SOSC_MASK                      equ 0001h
APMPERE1L_POSC_POSN                      equ 0001h
APMPERE1L_POSC_POSITION                  equ 0001h
APMPERE1L_POSC_SIZE                      equ 0001h
APMPERE1L_POSC_LENGTH                    equ 0001h
APMPERE1L_POSC_MASK                      equ 0002h
APMPERE1L_BG_POSN                        equ 0002h
APMPERE1L_BG_POSITION                    equ 0002h
APMPERE1L_BG_SIZE                        equ 0001h
APMPERE1L_BG_LENGTH                      equ 0001h
APMPERE1L_BG_MASK                        equ 0004h
APMPERE1L_FVR1_POSN                      equ 0003h
APMPERE1L_FVR1_POSITION                  equ 0003h
APMPERE1L_FVR1_SIZE                      equ 0001h
APMPERE1L_FVR1_LENGTH                    equ 0001h
APMPERE1L_FVR1_MASK                      equ 0008h
APMPERE1L_FVR2_POSN                      equ 0004h
APMPERE1L_FVR2_POSITION                  equ 0004h
APMPERE1L_FVR2_SIZE                      equ 0001h
APMPERE1L_FVR2_LENGTH                    equ 0001h
APMPERE1L_FVR2_MASK                      equ 0010h
APMPERE1L_ADCD_POSN                      equ 0005h
APMPERE1L_ADCD_POSITION                  equ 0005h
APMPERE1L_ADCD_SIZE                      equ 0001h
APMPERE1L_ADCD_LENGTH                    equ 0001h
APMPERE1L_ADCD_MASK                      equ 0020h
APMPERE1L_ADCA_POSN                      equ 0006h
APMPERE1L_ADCA_POSITION                  equ 0006h
APMPERE1L_ADCA_SIZE                      equ 0001h
APMPERE1L_ADCA_LENGTH                    equ 0001h
APMPERE1L_ADCA_MASK                      equ 0040h
APMPERE1L_TEMP_POSN                      equ 0007h
APMPERE1L_TEMP_POSITION                  equ 0007h
APMPERE1L_TEMP_SIZE                      equ 0001h
APMPERE1L_TEMP_LENGTH                    equ 0001h
APMPERE1L_TEMP_MASK                      equ 0080h
APMPERE1L_APMPERE1_2_POSN                equ 0002h
APMPERE1L_APMPERE1_2_POSITION            equ 0002h
APMPERE1L_APMPERE1_2_SIZE                equ 0001h
APMPERE1L_APMPERE1_2_LENGTH              equ 0001h
APMPERE1L_APMPERE1_2_MASK                equ 0004h
APMPERE1L_APMPERE1_3_POSN                equ 0003h
APMPERE1L_APMPERE1_3_POSITION            equ 0003h
APMPERE1L_APMPERE1_3_SIZE                equ 0001h
APMPERE1L_APMPERE1_3_LENGTH              equ 0001h
APMPERE1L_APMPERE1_3_MASK                equ 0008h
APMPERE1L_APMPERE1_4_POSN                equ 0004h
APMPERE1L_APMPERE1_4_POSITION            equ 0004h
APMPERE1L_APMPERE1_4_SIZE                equ 0001h
APMPERE1L_APMPERE1_4_LENGTH              equ 0001h
APMPERE1L_APMPERE1_4_MASK                equ 0010h
APMPERE1L_APMPERE1_5_POSN                equ 0005h
APMPERE1L_APMPERE1_5_POSITION            equ 0005h
APMPERE1L_APMPERE1_5_SIZE                equ 0001h
APMPERE1L_APMPERE1_5_LENGTH              equ 0001h
APMPERE1L_APMPERE1_5_MASK                equ 0020h
APMPERE1L_APMPERE1_6_POSN                equ 0006h
APMPERE1L_APMPERE1_6_POSITION            equ 0006h
APMPERE1L_APMPERE1_6_SIZE                equ 0001h
APMPERE1L_APMPERE1_6_LENGTH              equ 0001h
APMPERE1L_APMPERE1_6_MASK                equ 0040h
APMPERE1L_APMPERE1_7_POSN                equ 0007h
APMPERE1L_APMPERE1_7_POSITION            equ 0007h
APMPERE1L_APMPERE1_7_SIZE                equ 0001h
APMPERE1L_APMPERE1_7_LENGTH              equ 0001h
APMPERE1L_APMPERE1_7_MASK                equ 0080h

// Register: APMPERE1H
#define APMPERE1H APMPERE1H
APMPERE1H                                equ 01F60h
// bitfield definitions
APMPERE1H_APMPERE1_POSN                  equ 0000h
APMPERE1H_APMPERE1_POSITION              equ 0000h
APMPERE1H_APMPERE1_SIZE                  equ 0008h
APMPERE1H_APMPERE1_LENGTH                equ 0008h
APMPERE1H_APMPERE1_MASK                  equ 00FFh
APMPERE1H_OPA1_POSN                      equ 0000h
APMPERE1H_OPA1_POSITION                  equ 0000h
APMPERE1H_OPA1_SIZE                      equ 0001h
APMPERE1H_OPA1_LENGTH                    equ 0001h
APMPERE1H_OPA1_MASK                      equ 0001h
APMPERE1H_OPA2_POSN                      equ 0001h
APMPERE1H_OPA2_POSITION                  equ 0001h
APMPERE1H_OPA2_SIZE                      equ 0001h
APMPERE1H_OPA2_LENGTH                    equ 0001h
APMPERE1H_OPA2_MASK                      equ 0002h
APMPERE1H_DAC1_POSN                      equ 0002h
APMPERE1H_DAC1_POSITION                  equ 0002h
APMPERE1H_DAC1_SIZE                      equ 0001h
APMPERE1H_DAC1_LENGTH                    equ 0001h
APMPERE1H_DAC1_MASK                      equ 0004h
APMPERE1H_DAC2_POSN                      equ 0003h
APMPERE1H_DAC2_POSITION                  equ 0003h
APMPERE1H_DAC2_SIZE                      equ 0001h
APMPERE1H_DAC2_LENGTH                    equ 0001h
APMPERE1H_DAC2_MASK                      equ 0008h
APMPERE1H_CMP1_POSN                      equ 0005h
APMPERE1H_CMP1_POSITION                  equ 0005h
APMPERE1H_CMP1_SIZE                      equ 0001h
APMPERE1H_CMP1_LENGTH                    equ 0001h
APMPERE1H_CMP1_MASK                      equ 0020h
APMPERE1H_CMPLP1_POSN                    equ 0006h
APMPERE1H_CMPLP1_POSITION                equ 0006h
APMPERE1H_CMPLP1_SIZE                    equ 0001h
APMPERE1H_CMPLP1_LENGTH                  equ 0001h
APMPERE1H_CMPLP1_MASK                    equ 0040h
APMPERE1H_ZCD_POSN                       equ 0007h
APMPERE1H_ZCD_POSITION                   equ 0007h
APMPERE1H_ZCD_SIZE                       equ 0001h
APMPERE1H_ZCD_LENGTH                     equ 0001h
APMPERE1H_ZCD_MASK                       equ 0080h
APMPERE1H_APMPERE1_8_POSN                equ 0000h
APMPERE1H_APMPERE1_8_POSITION            equ 0000h
APMPERE1H_APMPERE1_8_SIZE                equ 0001h
APMPERE1H_APMPERE1_8_LENGTH              equ 0001h
APMPERE1H_APMPERE1_8_MASK                equ 0001h
APMPERE1H_APMPERE1_9_POSN                equ 0001h
APMPERE1H_APMPERE1_9_POSITION            equ 0001h
APMPERE1H_APMPERE1_9_SIZE                equ 0001h
APMPERE1H_APMPERE1_9_LENGTH              equ 0001h
APMPERE1H_APMPERE1_9_MASK                equ 0002h
APMPERE1H_APMPERE1_10_POSN               equ 0002h
APMPERE1H_APMPERE1_10_POSITION           equ 0002h
APMPERE1H_APMPERE1_10_SIZE               equ 0001h
APMPERE1H_APMPERE1_10_LENGTH             equ 0001h
APMPERE1H_APMPERE1_10_MASK               equ 0004h
APMPERE1H_APMPERE1_11_POSN               equ 0003h
APMPERE1H_APMPERE1_11_POSITION           equ 0003h
APMPERE1H_APMPERE1_11_SIZE               equ 0001h
APMPERE1H_APMPERE1_11_LENGTH             equ 0001h
APMPERE1H_APMPERE1_11_MASK               equ 0008h
APMPERE1H_APMPERE1_13_POSN               equ 0005h
APMPERE1H_APMPERE1_13_POSITION           equ 0005h
APMPERE1H_APMPERE1_13_SIZE               equ 0001h
APMPERE1H_APMPERE1_13_LENGTH             equ 0001h
APMPERE1H_APMPERE1_13_MASK               equ 0020h
APMPERE1H_APMPERE1_14_POSN               equ 0006h
APMPERE1H_APMPERE1_14_POSITION           equ 0006h
APMPERE1H_APMPERE1_14_SIZE               equ 0001h
APMPERE1H_APMPERE1_14_LENGTH             equ 0001h
APMPERE1H_APMPERE1_14_MASK               equ 0040h
APMPERE1H_APMPERE1_15_POSN               equ 0007h
APMPERE1H_APMPERE1_15_POSITION           equ 0007h
APMPERE1H_APMPERE1_15_SIZE               equ 0001h
APMPERE1H_APMPERE1_15_LENGTH             equ 0001h
APMPERE1H_APMPERE1_15_MASK               equ 0080h

// Register: APMPERE1U
#define APMPERE1U APMPERE1U
APMPERE1U                                equ 01F61h
// bitfield definitions
APMPERE1U_APMPERE1_POSN                  equ 0000h
APMPERE1U_APMPERE1_POSITION              equ 0000h
APMPERE1U_APMPERE1_SIZE                  equ 0008h
APMPERE1U_APMPERE1_LENGTH                equ 0008h
APMPERE1U_APMPERE1_MASK                  equ 00FFh
APMPERE1U_OPA3_POSN                      equ 0000h
APMPERE1U_OPA3_POSITION                  equ 0000h
APMPERE1U_OPA3_SIZE                      equ 0001h
APMPERE1U_OPA3_LENGTH                    equ 0001h
APMPERE1U_OPA3_MASK                      equ 0001h
APMPERE1U_OPA4_POSN                      equ 0001h
APMPERE1U_OPA4_POSITION                  equ 0001h
APMPERE1U_OPA4_SIZE                      equ 0001h
APMPERE1U_OPA4_LENGTH                    equ 0001h
APMPERE1U_OPA4_MASK                      equ 0002h
APMPERE1U_VREFLPDAC_POSN                 equ 0006h
APMPERE1U_VREFLPDAC_POSITION             equ 0006h
APMPERE1U_VREFLPDAC_SIZE                 equ 0001h
APMPERE1U_VREFLPDAC_LENGTH               equ 0001h
APMPERE1U_VREFLPDAC_MASK                 equ 0040h
APMPERE1U_VREFLP_POSN                    equ 0007h
APMPERE1U_VREFLP_POSITION                equ 0007h
APMPERE1U_VREFLP_SIZE                    equ 0001h
APMPERE1U_VREFLP_LENGTH                  equ 0001h
APMPERE1U_VREFLP_MASK                    equ 0080h

// Register: APMEND2L
#define APMEND2L APMEND2L
APMEND2L                                 equ 01F62h
// bitfield definitions
APMEND2L_END2_POSN                       equ 0000h
APMEND2L_END2_POSITION                   equ 0000h
APMEND2L_END2_SIZE                       equ 0008h
APMEND2L_END2_LENGTH                     equ 0008h
APMEND2L_END2_MASK                       equ 00FFh

// Register: APMEND2H
#define APMEND2H APMEND2H
APMEND2H                                 equ 01F63h
// bitfield definitions
APMEND2H_END2_POSN                       equ 0000h
APMEND2H_END2_POSITION                   equ 0000h
APMEND2H_END2_SIZE                       equ 0008h
APMEND2H_END2_LENGTH                     equ 0008h
APMEND2H_END2_MASK                       equ 00FFh

// Register: APMEND2U
#define APMEND2U APMEND2U
APMEND2U                                 equ 01F64h
// bitfield definitions
APMEND2U_END2_POSN                       equ 0000h
APMEND2U_END2_POSITION                   equ 0000h
APMEND2U_END2_SIZE                       equ 0008h
APMEND2U_END2_LENGTH                     equ 0008h
APMEND2U_END2_MASK                       equ 00FFh

// Register: APMPERE2L
#define APMPERE2L APMPERE2L
APMPERE2L                                equ 01F65h
// bitfield definitions
APMPERE2L_SOSC_POSN                      equ 0000h
APMPERE2L_SOSC_POSITION                  equ 0000h
APMPERE2L_SOSC_SIZE                      equ 0001h
APMPERE2L_SOSC_LENGTH                    equ 0001h
APMPERE2L_SOSC_MASK                      equ 0001h
APMPERE2L_POSC_POSN                      equ 0001h
APMPERE2L_POSC_POSITION                  equ 0001h
APMPERE2L_POSC_SIZE                      equ 0001h
APMPERE2L_POSC_LENGTH                    equ 0001h
APMPERE2L_POSC_MASK                      equ 0002h
APMPERE2L_BG_POSN                        equ 0002h
APMPERE2L_BG_POSITION                    equ 0002h
APMPERE2L_BG_SIZE                        equ 0001h
APMPERE2L_BG_LENGTH                      equ 0001h
APMPERE2L_BG_MASK                        equ 0004h
APMPERE2L_FVR1_POSN                      equ 0003h
APMPERE2L_FVR1_POSITION                  equ 0003h
APMPERE2L_FVR1_SIZE                      equ 0001h
APMPERE2L_FVR1_LENGTH                    equ 0001h
APMPERE2L_FVR1_MASK                      equ 0008h
APMPERE2L_FVR2_POSN                      equ 0004h
APMPERE2L_FVR2_POSITION                  equ 0004h
APMPERE2L_FVR2_SIZE                      equ 0001h
APMPERE2L_FVR2_LENGTH                    equ 0001h
APMPERE2L_FVR2_MASK                      equ 0010h
APMPERE2L_ADCD_POSN                      equ 0005h
APMPERE2L_ADCD_POSITION                  equ 0005h
APMPERE2L_ADCD_SIZE                      equ 0001h
APMPERE2L_ADCD_LENGTH                    equ 0001h
APMPERE2L_ADCD_MASK                      equ 0020h
APMPERE2L_ADCA_POSN                      equ 0006h
APMPERE2L_ADCA_POSITION                  equ 0006h
APMPERE2L_ADCA_SIZE                      equ 0001h
APMPERE2L_ADCA_LENGTH                    equ 0001h
APMPERE2L_ADCA_MASK                      equ 0040h
APMPERE2L_TEMP_POSN                      equ 0007h
APMPERE2L_TEMP_POSITION                  equ 0007h
APMPERE2L_TEMP_SIZE                      equ 0001h
APMPERE2L_TEMP_LENGTH                    equ 0001h
APMPERE2L_TEMP_MASK                      equ 0080h
APMPERE2L_APMPERE2_POSN                  equ 0000h
APMPERE2L_APMPERE2_POSITION              equ 0000h
APMPERE2L_APMPERE2_SIZE                  equ 0008h
APMPERE2L_APMPERE2_LENGTH                equ 0008h
APMPERE2L_APMPERE2_MASK                  equ 00FFh
APMPERE2L_APMPERE2_2_POSN                equ 0002h
APMPERE2L_APMPERE2_2_POSITION            equ 0002h
APMPERE2L_APMPERE2_2_SIZE                equ 0001h
APMPERE2L_APMPERE2_2_LENGTH              equ 0001h
APMPERE2L_APMPERE2_2_MASK                equ 0004h
APMPERE2L_APMPERE2_3_POSN                equ 0003h
APMPERE2L_APMPERE2_3_POSITION            equ 0003h
APMPERE2L_APMPERE2_3_SIZE                equ 0001h
APMPERE2L_APMPERE2_3_LENGTH              equ 0001h
APMPERE2L_APMPERE2_3_MASK                equ 0008h
APMPERE2L_APMPERE2_4_POSN                equ 0004h
APMPERE2L_APMPERE2_4_POSITION            equ 0004h
APMPERE2L_APMPERE2_4_SIZE                equ 0001h
APMPERE2L_APMPERE2_4_LENGTH              equ 0001h
APMPERE2L_APMPERE2_4_MASK                equ 0010h
APMPERE2L_APMPERE2_5_POSN                equ 0005h
APMPERE2L_APMPERE2_5_POSITION            equ 0005h
APMPERE2L_APMPERE2_5_SIZE                equ 0001h
APMPERE2L_APMPERE2_5_LENGTH              equ 0001h
APMPERE2L_APMPERE2_5_MASK                equ 0020h
APMPERE2L_APMPERE2_6_POSN                equ 0006h
APMPERE2L_APMPERE2_6_POSITION            equ 0006h
APMPERE2L_APMPERE2_6_SIZE                equ 0001h
APMPERE2L_APMPERE2_6_LENGTH              equ 0001h
APMPERE2L_APMPERE2_6_MASK                equ 0040h
APMPERE2L_APMPERE2_7_POSN                equ 0007h
APMPERE2L_APMPERE2_7_POSITION            equ 0007h
APMPERE2L_APMPERE2_7_SIZE                equ 0001h
APMPERE2L_APMPERE2_7_LENGTH              equ 0001h
APMPERE2L_APMPERE2_7_MASK                equ 0080h

// Register: APMPERE2H
#define APMPERE2H APMPERE2H
APMPERE2H                                equ 01F66h
// bitfield definitions
APMPERE2H_APMPERE2_POSN                  equ 0000h
APMPERE2H_APMPERE2_POSITION              equ 0000h
APMPERE2H_APMPERE2_SIZE                  equ 0008h
APMPERE2H_APMPERE2_LENGTH                equ 0008h
APMPERE2H_APMPERE2_MASK                  equ 00FFh
APMPERE2H_OPA1_POSN                      equ 0000h
APMPERE2H_OPA1_POSITION                  equ 0000h
APMPERE2H_OPA1_SIZE                      equ 0001h
APMPERE2H_OPA1_LENGTH                    equ 0001h
APMPERE2H_OPA1_MASK                      equ 0001h
APMPERE2H_OPA2_POSN                      equ 0001h
APMPERE2H_OPA2_POSITION                  equ 0001h
APMPERE2H_OPA2_SIZE                      equ 0001h
APMPERE2H_OPA2_LENGTH                    equ 0001h
APMPERE2H_OPA2_MASK                      equ 0002h
APMPERE2H_DAC1_POSN                      equ 0002h
APMPERE2H_DAC1_POSITION                  equ 0002h
APMPERE2H_DAC1_SIZE                      equ 0001h
APMPERE2H_DAC1_LENGTH                    equ 0001h
APMPERE2H_DAC1_MASK                      equ 0004h
APMPERE2H_DAC2_POSN                      equ 0003h
APMPERE2H_DAC2_POSITION                  equ 0003h
APMPERE2H_DAC2_SIZE                      equ 0001h
APMPERE2H_DAC2_LENGTH                    equ 0001h
APMPERE2H_DAC2_MASK                      equ 0008h
APMPERE2H_CMP1_POSN                      equ 0005h
APMPERE2H_CMP1_POSITION                  equ 0005h
APMPERE2H_CMP1_SIZE                      equ 0001h
APMPERE2H_CMP1_LENGTH                    equ 0001h
APMPERE2H_CMP1_MASK                      equ 0020h
APMPERE2H_CMPLP1_POSN                    equ 0006h
APMPERE2H_CMPLP1_POSITION                equ 0006h
APMPERE2H_CMPLP1_SIZE                    equ 0001h
APMPERE2H_CMPLP1_LENGTH                  equ 0001h
APMPERE2H_CMPLP1_MASK                    equ 0040h
APMPERE2H_ZCD_POSN                       equ 0007h
APMPERE2H_ZCD_POSITION                   equ 0007h
APMPERE2H_ZCD_SIZE                       equ 0001h
APMPERE2H_ZCD_LENGTH                     equ 0001h
APMPERE2H_ZCD_MASK                       equ 0080h
APMPERE2H_APMPERE2_8_POSN                equ 0000h
APMPERE2H_APMPERE2_8_POSITION            equ 0000h
APMPERE2H_APMPERE2_8_SIZE                equ 0001h
APMPERE2H_APMPERE2_8_LENGTH              equ 0001h
APMPERE2H_APMPERE2_8_MASK                equ 0001h
APMPERE2H_APMPERE2_9_POSN                equ 0001h
APMPERE2H_APMPERE2_9_POSITION            equ 0001h
APMPERE2H_APMPERE2_9_SIZE                equ 0001h
APMPERE2H_APMPERE2_9_LENGTH              equ 0001h
APMPERE2H_APMPERE2_9_MASK                equ 0002h
APMPERE2H_APMPERE2_10_POSN               equ 0002h
APMPERE2H_APMPERE2_10_POSITION           equ 0002h
APMPERE2H_APMPERE2_10_SIZE               equ 0001h
APMPERE2H_APMPERE2_10_LENGTH             equ 0001h
APMPERE2H_APMPERE2_10_MASK               equ 0004h
APMPERE2H_APMPERE2_11_POSN               equ 0003h
APMPERE2H_APMPERE2_11_POSITION           equ 0003h
APMPERE2H_APMPERE2_11_SIZE               equ 0001h
APMPERE2H_APMPERE2_11_LENGTH             equ 0001h
APMPERE2H_APMPERE2_11_MASK               equ 0008h
APMPERE2H_APMPERE2_13_POSN               equ 0005h
APMPERE2H_APMPERE2_13_POSITION           equ 0005h
APMPERE2H_APMPERE2_13_SIZE               equ 0001h
APMPERE2H_APMPERE2_13_LENGTH             equ 0001h
APMPERE2H_APMPERE2_13_MASK               equ 0020h
APMPERE2H_APMPERE2_14_POSN               equ 0006h
APMPERE2H_APMPERE2_14_POSITION           equ 0006h
APMPERE2H_APMPERE2_14_SIZE               equ 0001h
APMPERE2H_APMPERE2_14_LENGTH             equ 0001h
APMPERE2H_APMPERE2_14_MASK               equ 0040h
APMPERE2H_APMPERE2_15_POSN               equ 0007h
APMPERE2H_APMPERE2_15_POSITION           equ 0007h
APMPERE2H_APMPERE2_15_SIZE               equ 0001h
APMPERE2H_APMPERE2_15_LENGTH             equ 0001h
APMPERE2H_APMPERE2_15_MASK               equ 0080h

// Register: APMPERE2U
#define APMPERE2U APMPERE2U
APMPERE2U                                equ 01F67h
// bitfield definitions
APMPERE2U_OPA3_POSN                      equ 0000h
APMPERE2U_OPA3_POSITION                  equ 0000h
APMPERE2U_OPA3_SIZE                      equ 0001h
APMPERE2U_OPA3_LENGTH                    equ 0001h
APMPERE2U_OPA3_MASK                      equ 0001h
APMPERE2U_OPA4_POSN                      equ 0001h
APMPERE2U_OPA4_POSITION                  equ 0001h
APMPERE2U_OPA4_SIZE                      equ 0001h
APMPERE2U_OPA4_LENGTH                    equ 0001h
APMPERE2U_OPA4_MASK                      equ 0002h
APMPERE2U_VREFLPDAC_POSN                 equ 0006h
APMPERE2U_VREFLPDAC_POSITION             equ 0006h
APMPERE2U_VREFLPDAC_SIZE                 equ 0001h
APMPERE2U_VREFLPDAC_LENGTH               equ 0001h
APMPERE2U_VREFLPDAC_MASK                 equ 0040h
APMPERE2U_VREFLP_POSN                    equ 0007h
APMPERE2U_VREFLP_POSITION                equ 0007h
APMPERE2U_VREFLP_SIZE                    equ 0001h
APMPERE2U_VREFLP_LENGTH                  equ 0001h
APMPERE2U_VREFLP_MASK                    equ 0080h

